snlkuharlocal/src/Documents/ПланРаботАсу/ПланРаботАсу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланРаботАсу</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийТекущейНедели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСледующейНедели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.ЗадачиАСУ</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеВыполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьАкт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Внеплановая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеренесенаСПрошлогоПлана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВид</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСерия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДатаВыдачи</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКемВыдан</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКодПодразделения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВУ</name>
    <comment>Номер водительского удостоверения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение (Периодический реквизит)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штатный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительныйПадеж</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АссистентМенеджера</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПодразделенияУСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомерСотрудникаЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПропускВездеход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПродаж</name>
    <comment>Работник склада забронирован данным подразделением ЦО</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОдобренСБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПланРаботАсу/ManagerModule.bsl
Функция НайтиСоздатьПланРаботАСУ (Дата,Подразделение) экспорт
	Запрос=новый запрос;
	запрос.Текст=    "ВЫБРАТЬ первые 1
	                 |	ПланРаботАсу.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Документ.ПланРаботАсу КАК ПланРаботАсу
	                 |ГДЕ
	                 |	ПланРаботАсу.Проведен
	                 |	И ПланРаботАсу.Дата = &Дата
	                 |	И ПланРаботАсу.ПодразделениеИсполнителя = &Подразделение";
	запрос.УстановитьПараметр("Дата",НачалоНедели(Дата));
	запрос.УстановитьПараметр("Подразделение",Подразделение);
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат результат.ссылка;
	КонецЦикла;
	
	ПланРабот=Документы.ПланРаботАсу.СоздатьДокумент();
	ПланРабот.Дата=НачалоНедели(ТекущаяДата());
	ПланРабот.ПодразделениеИсполнителя=Подразделение;
	ПланРабот.ДатаОкончания=КонецНедели(ТекущаяДата());
	ПланРабот.Исполнитель=ПолучитьИсполнителяПоПодразделению(Подразделение);
	
	ПланРабот.Записать(РежимЗаписиДокумента.Проведение);
	СообщитьИзМодуля("Создан "+ПланРабот);
	
	
	возврат ПланРабот.Ссылка;
КонецФункции



Процедура ДобавитьМассивЗадачВПлан (Подразделение,МассивЗадач) экспорт
	
	ПланСсылка=НайтиСоздатьПланРаботАСУ(ТекущаяДата(),Подразделение);

	
	
	
	
		

	
	
	
	
	если ложь тогда ПланСсылка=документы.ПланРаботАсу.ПустаяСсылка();КонецЕсли;
	
	ПланРаботОбъект=ПланСсылка.ПолучитьОбъект();
	
	Если ПланРаботОбъект.Задачи.Количество()=0 тогда
		ПервичноеЗаполнение=Истина;
	Иначе
		ПервичноеЗаполнение=ложь;
	КонецЕсли;
	Внеплановая=не ПервичноеЗаполнение;
	
	
	

	// Кухарь А.Ю.  07.06.2022 начало
	если ПервичноеЗаполнение тогда
		ДействияФормыЗаполнитьСтарыеЗадачи(ПланРаботОбъект);
	КонецЕсли;
	// Кухарь А.Ю.  07.06.2022 конец
	
	
	
	
	
	
	НачатьТранзакцию();
	
	Для каждого ТекЗадача из МассивЗадач Цикл 
		
		// Андреев И.Д. 31.08.2022 начало
		// Проверка на задачи которые уже есть в плане
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПланРаботАсуЗадачи.НомерСтроки КАК НомерСтроки,
		               |	ПланРаботАсуЗадачи.Задача КАК Задача
		               |ИЗ
		               |	Документ.ПланРаботАсу.Задачи КАК ПланРаботАсуЗадачи
		               |ГДЕ
		               |	ПланРаботАсуЗадачи.Ссылка.Ссылка = &ПланСсылка
		               |	И НЕ ПланРаботАсуЗадачи.Ссылка.ПометкаУдаления
		               |	И ПланРаботАсуЗадачи.Задача = &ТекЗадача";
		
		Запрос.УстановитьПараметр("ПланССылка", ПланССылка);
		Запрос.УстановитьПараметр("ТекЗадача",ТекЗадача.задача);
		результат=Запрос.Выполнить().Выгрузить(); 
		
		Если Результат.Количество()=0 тогда;
			
		Иначе
			
			Для каждого СтрТч из результат цикл 
				Сообщить("Задача уже есть в плане, номер строки: "+СтрТч.номерстроки);	
				КонецЦикла;	
			
			    Продолжить;

		КонецЕсли;
		
		// Андреев И.Д. 31.08.2022 конец

		
		
		если ПланРаботОбъект.Задачи.Найти(ТекЗадача) <> Неопределено тогда
			СообщитьИзМодуля("Задача "+ТекЗадача+" не добавлена в план "+ПланСсылка+" т.к. уже там была.");
			Продолжить;
		КонецЕсли;
		если ТипЗнч(ТекЗадача)=Тип("СтрокаТаблицыЗначений") тогда
			ТекЗадача=ТекЗадача.Задача;
		КонецЕсли; 
		
		СтрТЧ=ПланРаботОбъект.Задачи.Добавить();
		СтрТЧ.Задача=ТекЗадача;
		
		// Кухарь А.Ю. 20.05.2022 начало
		СтрТЧ.Исполнитель=СтрТЧ.Задача.НастоящийИсполнитель; 
		// Кухарь А.Ю. 20.05.2022 конец
		
		// Андреев И.Д. 09.08.2022 начало
		Если  ПланРаботОбъект.ЗаполненПлан = ложь тогда
			Внеплановая = ложь;
		КонецЕсли;
		// Андреев И.Д. 09.08.2022 конец
		

		ОбработатьЗаполнениеЗадачиВСтроке(ПланРаботОбъект,СтрТЧ,Внеплановая,,Истина);
		СообщитьИзМодуля("Задача "+ТекЗадача.номер+" добавлена в план "+ПланРаботОбъект.Номер+". ")
		
	КонецЦикла;
	ПланРаботОбъект.Записать();
	ЗафиксироватьТранзакцию();
	
	#ЕСЛИ КЛИЕНТ ТОГДА
		ПланРаботОбъект.ПолучитьФорму("ФормаДокумента").Открыть();
	#КОНЕЦЕСЛИ

	
КонецПроцедуры

Функция ПолучитьИсполнителяПоПодразделению(Подразделение) экспорт
	Запрос=новый запрос;
	запрос.Текст=    "ВЫБРАТЬ ПЕРВЫЕ 1
	                 |	ПланРаботАсу.Исполнитель КАК Исполнитель,
	                 |	ПланРаботАсу.Дата КАК Дата
	                 |ИЗ
	                 |	Документ.ПланРаботАсу КАК ПланРаботАсу
	                 |ГДЕ
	                 |	 ПланРаботАсу.ПодразделениеИсполнителя = &Подразделение
	                 |	И ПланРаботАсу.Исполнитель <> &Исполнитель
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ПланРаботАсу.Дата УБЫВ";
	запрос.УстановитьПараметр("Подразделение",Подразделение);
	запрос.УстановитьПараметр("Исполнитель",Справочники.ФизическиеЛица.ПустаяСсылка());
	
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		возврат результат.Исполнитель;
	КонецЦикла;

	возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	

КонецФункции

Процедура ОбработатьЗаполнениеЗадачиВСтроке(ДокОбъект,СтрокаТЧ,Внеплановая=ложь,ПеренесенаСПрошлогоПлана=ложь,ОтправлятьУведомление=ложь) экспорт
	если не ЗначениеЗаполнено(СтрокаТЧ.Задача) тогда Возврат;КонецЕсли;
	СтрокаТЧ.Описание=СтрокаТЧ.Задача.ПолноеОписаниеЗадачи;
	СтрокаТЧ.Внеплановая=Внеплановая;
	СтрокаТЧ.ПеренесенаСПрошлогоПлана=ПеренесенаСПрошлогоПлана;
	
	
	если ложь тогда ДокОбъект=документы.ПланРаботАсу.СоздатьДокумент();КонецЕсли;
	если ОтправлятьУведомление  тогда
		ЕМэйл=ДокОбъект.Исполнитель.ЕМэйл;
		если не ЗначениеЗаполнено(ЕМэйл) тогда
			ЕМэйл=ПолучитьЕмейлПоКоду(ПараметрыСеанса.Пользователь.ФизЛицо);
		КонецЕсли;
		если ЗначениеЗаполнено(ЕМэйл) и ПараметрыСеанса.Пользователь.ФизЛицо<>ДокОбъект.Исполнитель тогда
			СписокПолучателей=новый СписокЗначений;
			СписокПолучателей.Добавить(ЕМэйл);
			ТекстПисьма="В план работ № "+ДокОбъект.Номер+" добавлена задача "+СтрокаТЧ.Задача.Номер+". "+СтрокаТЧ.Задача.ПолноеОписаниеЗадачи;
			ТемаПисьма="Уведомление о новой задаче";			
			СформироватьВнутреннееУведомление(СписокПолучателей,ТекстПисьма,ТемаПисьма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЕмейлПоКоду (ФизЛицо)
	КодФЛ=ФизЛицо.код;
	если КодФЛ="SNL-00316" тогда
		возврат "zhuravlev@collant.ru";
	//ИначеЕсли КодФЛ="SNL-02326" тогда
	//	возврат "nikolaev@collant.ru";
	ИначеЕсли КодФЛ="SNL--00075" тогда
		возврат "krohin@collant.ru";	
	ИначеЕсли КодФЛ="SNL-07579" тогда
		возврат "orlov@collant.ru";
	иначе 
		возврат Неопределено;
	КонецЕсли;
КонецФункции


// Кухарь А.Ю.  07.06.2022 начало
//
 




Процедура ДействияФормыЗаполнитьСтарыеЗадачи(ДокОбъект) экспорт
	если ложь тогда
		ДокОбъект=Документы.ПланРаботАсу.СоздатьДокумент();
	КонецЕсли;
	// Кухарь А.Ю.  20.06.2022 начало
	//Опечатка
	//	если ЗначениеЗаполнено(ДокОбъект.Ссылка) тогда 
	если не ЗначениеЗаполнено(ДокОбъект.Ссылка) тогда 
		// Кухарь А.Ю.  20.06.2022 конец
		ТекДок=Неопределено;
	иначе
		Текдок=ДокОбъект.Ссылка;
	КонецЕсли;
	
	ПодразделениеИсполнителя=ДокОбъект.ПодразделениеИсполнителя;
	
	
	
	если ЗначениеЗаполнено(ПодразделениеИсполнителя) тогда
		МассСтрок=ДокОбъект.Задачи.НайтиСтроки(новый Структура("ПеренесенаСПрошлогоПлана",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			ДокОбъект.Задачи.Удалить(СтрМасс);
		КонецЦикла;
		
		ТЗСтарыхЗадач =  ДокОбъект.ПолучитьЗадачиПрошлогоПлана(ПодразделениеИсполнителя,ТекДок);
		Для каждого СтрТЗ из ТЗСтарыхЗадач цикл
			если ДокОбъект.Задачи.Найти(СтрТЗ.Задача)<> Неопределено тогда Продолжить; КонецЕсли;
			СтрТЧ=ДокОбъект.Задачи.Добавить();
			СтрТЧ.Задача=СтрТЗ.задача;
			СтрТЧ.Описание=СтрТЗ.задача.полноеОписаниеЗадачи;
			СтрТЧ.ПеренесенаСПрошлогоПлана=Истина;
			// Кухарь А.Ю.  23.08.2022 начало
			СтрТЧ.Исполнитель=СтрТЧ.Задача.РеальныйИсполнитель; 
			// Кухарь А.Ю.  23.08.2022 конец
			
			СообщитьИзМодуля("Добавлена задача "+СтрТЧ.Задача.Номер+" из предыдущего плана работ.");
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Кухарь А.Ю.  07.06.2022 конец
